{
  "_name_or_path": "d4data/biomedical-ner-all",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-Activity",
    "2": "B-Administration",
    "3": "B-Age",
    "4": "B-Area",
    "5": "B-Biological_attribute",
    "6": "B-Biological_structure",
    "7": "B-Clinical_event",
    "8": "B-Color",
    "9": "B-Coreference",
    "10": "B-Date",
    "11": "B-Detailed_description",
    "12": "B-Diagnostic_procedure",
    "13": "B-Disease_disorder",
    "14": "B-Distance",
    "15": "B-Dosage",
    "16": "B-Duration",
    "17": "B-Family_history",
    "18": "B-Frequency",
    "19": "B-Height",
    "20": "B-History",
    "21": "B-Lab_value",
    "22": "B-Mass",
    "23": "B-Medication",
    "24": "B-Non[biological](Detailed_description",
    "25": "B-Nonbiological_location",
    "26": "B-Occupation",
    "27": "B-Other_entity",
    "28": "B-Other_event",
    "29": "B-Outcome",
    "30": "B-Personal_[back](Biological_structure",
    "31": "B-Personal_background",
    "32": "B-Qualitative_concept",
    "33": "B-Quantitative_concept",
    "34": "B-Severity",
    "35": "B-Sex",
    "36": "B-Shape",
    "37": "B-Sign_symptom",
    "38": "B-Subject",
    "39": "B-Texture",
    "40": "B-Therapeutic_procedure",
    "41": "B-Time",
    "42": "B-Volume",
    "43": "B-Weight",
    "44": "I-Activity",
    "45": "I-Administration",
    "46": "I-Age",
    "47": "I-Area",
    "48": "I-Biological_attribute",
    "49": "I-Biological_structure",
    "50": "I-Clinical_event",
    "51": "I-Color",
    "52": "I-Coreference",
    "53": "I-Date",
    "54": "I-Detailed_description",
    "55": "I-Diagnostic_procedure",
    "56": "I-Disease_disorder",
    "57": "I-Distance",
    "58": "I-Dosage",
    "59": "I-Duration",
    "60": "I-Family_history",
    "61": "I-Frequency",
    "62": "I-Height",
    "63": "I-History",
    "64": "I-Lab_value",
    "65": "I-Mass",
    "66": "I-Medication",
    "67": "I-Nonbiological_location",
    "68": "I-Occupation",
    "69": "I-Other_entity",
    "70": "I-Other_event",
    "71": "I-Outcome",
    "72": "I-Personal_background",
    "73": "I-Qualitative_concept",
    "74": "I-Quantitative_concept",
    "75": "I-Severity",
    "76": "I-Shape",
    "77": "I-Sign_symptom",
    "78": "I-Subject",
    "79": "I-Texture",
    "80": "I-Therapeutic_procedure",
    "81": "I-Time",
    "82": "I-Volume",
    "83": "I-Weight"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-Activity": 1,
    "B-Administration": 2,
    "B-Age": 3,
    "B-Area": 4,
    "B-Biological_attribute": 5,
    "B-Biological_structure": 6,
    "B-Clinical_event": 7,
    "B-Color": 8,
    "B-Coreference": 9,
    "B-Date": 10,
    "B-Detailed_description": 11,
    "B-Diagnostic_procedure": 12,
    "B-Disease_disorder": 13,
    "B-Distance": 14,
    "B-Dosage": 15,
    "B-Duration": 16,
    "B-Family_history": 17,
    "B-Frequency": 18,
    "B-Height": 19,
    "B-History": 20,
    "B-Lab_value": 21,
    "B-Mass": 22,
    "B-Medication": 23,
    "B-Non[biological](Detailed_description": 24,
    "B-Nonbiological_location": 25,
    "B-Occupation": 26,
    "B-Other_entity": 27,
    "B-Other_event": 28,
    "B-Outcome": 29,
    "B-Personal_[back](Biological_structure": 30,
    "B-Personal_background": 31,
    "B-Qualitative_concept": 32,
    "B-Quantitative_concept": 33,
    "B-Severity": 34,
    "B-Sex": 35,
    "B-Shape": 36,
    "B-Sign_symptom": 37,
    "B-Subject": 38,
    "B-Texture": 39,
    "B-Therapeutic_procedure": 40,
    "B-Time": 41,
    "B-Volume": 42,
    "B-Weight": 43,
    "I-Activity": 44,
    "I-Administration": 45,
    "I-Age": 46,
    "I-Area": 47,
    "I-Biological_attribute": 48,
    "I-Biological_structure": 49,
    "I-Clinical_event": 50,
    "I-Color": 51,
    "I-Coreference": 52,
    "I-Date": 53,
    "I-Detailed_description": 54,
    "I-Diagnostic_procedure": 55,
    "I-Disease_disorder": 56,
    "I-Distance": 57,
    "I-Dosage": 58,
    "I-Duration": 59,
    "I-Family_history": 60,
    "I-Frequency": 61,
    "I-Height": 62,
    "I-History": 63,
    "I-Lab_value": 64,
    "I-Mass": 65,
    "I-Medication": 66,
    "I-Nonbiological_location": 67,
    "I-Occupation": 68,
    "I-Other_entity": 69,
    "I-Other_event": 70,
    "I-Outcome": 71,
    "I-Personal_background": 72,
    "I-Qualitative_concept": 73,
    "I-Quantitative_concept": 74,
    "I-Severity": 75,
    "I-Shape": 76,
    "I-Sign_symptom": 77,
    "I-Subject": 78,
    "I-Texture": 79,
    "I-Therapeutic_procedure": 80,
    "I-Time": 81,
    "I-Volume": 82,
    "I-Weight": 83,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "vocab_size": 30522
}
